Documents/А_ФинРез_DDS.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>А_ФинРез_DDS</Name>
			<Comment>Документ свёртки Cashflow за месяц. ОбработкаПроведения делает UNION 3 регистров ДС с маркером Source. Записывает в РегСв.А_ОтчетDDS_Свод. Spec v3 §3.5.</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.А_ОтчетDDS_Свод</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Месяц</Name>
					<Comment>Первый день месяца за который свёртка</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/А_ОтчетDDS_Свод.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>А_ОтчетDDS_Свод</Name>
			<Comment>Свёртка движений ДС за месяц: 3 источника Source × БанковскийСчетКасса × СтатьяДДС × Контрагент. CFS_Section денормализуется из реквизита А_РазделCFS. Заполняется при проведении Документ.А_ФинРез_DDS. Spec v3 §3.6.</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаГрн</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВалОригинала</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Source</Name>
					<Type>
						<v8:Type>cfg:EnumRef.А_ИсточникDDS</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>CFS_Section</Name>
					<Type>
						<v8:Type>cfg:EnumRef.А_РазделыCFS</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидДвижения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютаОригинала</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>БанковскийСчетКасса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчетаОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяДДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Документ_Источник</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.А_ПриходДенегОтФинАгента</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.А_ПереносДвиженийИзКазны</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеБезналичныхДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеБезналичныхДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ДенежныеСредстваБезналичные.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<AccumulationRegister>
		<Properties>
			<Name>ДенежныеСредстваБезналичные</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРегл</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КЗачислению</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КСписанию</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДвиженияДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АналитикаУчетаПоПартнерам</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючиАналитикиУчетаПоПартнерам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьЗаказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлатежныйДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеБезналичныхДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетБанкаПоОперациямЭквайринга</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеБезналичныхДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяКалькуляции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиКалькуляции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаХозяйственнойОперации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиХозяйственныхОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторФинЗаписи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектРасчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыРасчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>БанковскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчетаОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ДенежныеСредстваНаличные.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<AccumulationRegister>
		<Properties>
			<Name>ДенежныеСредстваНаличные</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРегл</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДвиженияДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АналитикаУчетаПоПартнерам</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючиАналитикиУчетаПоПартнерам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьЗаказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаХозяйственнойОперации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиХозяйственныхОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторФинЗаписи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектРасчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыРасчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/А_ДвиженияДенегИзКазны.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<AccumulationRegister>
		<Properties>
			<Name>А_ДвиженияДенегИзКазны</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>UIDРегистратораКазны</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстДокументаКазны</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>БанковскийСчетКасса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчетаОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>А_ОрганизацияБухгалтерия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяДвиженияДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПодразделениеКазна</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаправлениеДеятельностиКазна</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументДвиженияКазны</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.А_ПриходДенегОтФинАгента</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.А_ПереносДвиженийИзКазны</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеБезналичныхДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеБезналичныхДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ТипыДвиженияДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ТипыДвиженияДенежныхСредств</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Поступление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Списание</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/А_ФинРез_DDS/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		Организация = А_Привилегированный.А_ПолучитьОрганизациюУпр();
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Месяц) Тогда
		Месяц = НачалоМесяца(ТекущаяДатаСеанса());
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	// === Дублікат-захист по (Организация, Месяц) ===
	НачМесяца = НачалоМесяца(Месяц);
	КонМесяца = КонецМесяца(Месяц);

	ЗапросДубль = Новый Запрос;
	ЗапросДубль.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|    Dok.Ссылка КАК Ссылка,
	|    Dok.Номер  КАК Номер,
	|    Dok.Дата   КАК Дата
	|ИЗ Документ.А_ФинРез_DDS КАК Dok
	|ГДЕ
	|    Dok.Ссылка <> &ТекущийДок
	|    И НЕ Dok.ПометкаУдаления
	|    И Dok.Проведен
	|    И Dok.Организация = &Организация
	|    И Dok.Месяц МЕЖДУ &НачМесяца И &КонМесяца";
	ЗапросДубль.УстановитьПараметр("ТекущийДок",  Ссылка);
	ЗапросДубль.УстановитьПараметр("Организация", Организация);
	ЗапросДубль.УстановитьПараметр("НачМесяца",   НачМесяца);
	ЗапросДубль.УстановитьПараметр("КонМесяца",   КонМесяца);
	РезДубль = ЗапросДубль.Выполнить();
	Если НЕ РезДубль.Пустой() Тогда
		ВыбДубль = РезДубль.Выбрать();
		ВыбДубль.Следующий();
		ОбщегоНазначения.СообщитьПользователю(
			СтрШаблон("Не можна провести: за %1 (Організація %2) вже проведено документ %3 від %4. Перепроведіть існуючий або помітьте на видалення.",
				Формат(НачМесяца, "ДФ='ММММ yyyy'"),
				Организация,
				ВыбДубль.Номер,
				Формат(ВыбДубль.Дата, "ДФ='dd.MM.yyyy'")));
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	// === Свёртка ДДС — UNION 3 регістрів з Source-маркером ===
	Движения.А_ОтчетDDS_Свод.Записывать = Истина;

	Запрос = Новый Запрос;
	Запрос.Текст = СформироватьЗапросСверткиDDS();
	Запрос.УстановитьПараметр("НачалоПериода", НачМесяца);
	Запрос.УстановитьПараметр("КонецПериода",  КонМесяца);
	Запрос.УстановитьПараметр("Организация",   Организация);

	Движения.А_ОтчетDDS_Свод.Загрузить(Запрос.Выполнить().Выгрузить());

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Повертає верифікований SQL UNION 3 регістрів ДС з Source-маркером.
// Перевірений Python COM (Task 11): за лютий 2026 повертає ~4812 рядків
// з 3 distinct Source значеннями (ERP_Безнал/ERP_Нал/Казна).
//
// Параметри: &НачалоПериода, &КонецПериода, &Организация
//
// СТРУКТУРА ВИХОДУ (відповідає РегистрСведений.А_ОтчетDDS_Свод):
//   Виміри:    Организация, Подразделение, НаправлениеДеятельности,
//              БанковскийСчетКасса, СтатьяДДС, Контрагент, Договор, Документ_Источник
//   Ресурси:   СуммаГрн, СуммаВалОригинала, Source, CFS_Section,
//              ВидДвижения, ВалютаОригинала, Курс
//
// Тест: _Rarzrabotki/Python/test/test_finrez_dds_query_2026-05-01.py
// Результати лютий 2026 (Rule #-1 — verified before BSL):
//   ERP_Безнал: 1829 рядків, Σ 5,015,250,939.96 ₴
//   ERP_Нал:     351 рядків, Σ    31,833,351.75 ₴
//   Казна:      2632 рядків, Σ 5,270,079,061.07 ₴
//   ВидДвижения: Поступление=2899, Списание=1913
//   CFS_Section: 0 non-null (А_РазделCFS не заповнений в довіднику — очікувано)
Функция СформироватьЗапросСверткиDDS()
	Возврат
	"// Branch 1: ERP_Безнал — РегНакоп.ДенежныеСредстваБезналичные (raw table)
	|// Grouped by Регистратор + all dims + attribute СтатьяДвиженияДенежныхСредств.
	|// ВидДвижения derived from sign of СУММА(Сумма).
	|ВЫБРАТЬ
	|	Б.Регистратор.Дата                               КАК Период,
	|	Б.Организация                                    КАК Организация,
	|	Б.Подразделение                                  КАК Подразделение,
	|	Б.Подразделение.А_НаправлениеДеятельности         КАК НаправлениеДеятельности,
	|	Б.БанковскийСчет                                 КАК БанковскийСчетКасса,
	|	Б.СтатьяДвиженияДенежныхСредств                  КАК СтатьяДДС,
	|	Б.СтатьяДвиженияДенежныхСредств.А_РазделCFS      КАК CFS_Section,
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)    КАК Контрагент,
	|	ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка) КАК Договор,
	|	Б.Регистратор                                    КАК Документ_Источник,
	|	ВЫБОР КОГДА СУММА(Б.Сумма) >= 0
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыДвиженияДенежныхСредств.Поступление)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыДвиженияДенежныхСредств.Списание)
	|	КОНЕЦ                                            КАК ВидДвижения,
	|	Б.БанковскийСчет.ВалютаДенежныхСредств           КАК ВалютаОригинала,
	|	1                                                КАК Курс,
	|	ВЫБОР КОГДА СУММА(Б.Сумма) < 0 ТОГДА -СУММА(Б.Сумма) ИНАЧЕ СУММА(Б.Сумма) КОНЕЦ КАК СуммаГрн,
	|	ВЫБОР КОГДА СУММА(Б.Сумма) < 0 ТОГДА -СУММА(Б.Сумма) ИНАЧЕ СУММА(Б.Сумма) КОНЕЦ КАК СуммаВалОригинала,
	|	ЗНАЧЕНИЕ(Перечисление.А_ИсточникDDS.ERP_Безнал)  КАК Source
	|ПОМЕСТИТЬ втDDS
	|ИЗ РегистрНакопления.ДенежныеСредстваБезналичные КАК Б
	|ГДЕ Б.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Б.Активность И Б.Сумма <> 0
	|СГРУППИРОВАТЬ ПО
	|	Б.Регистратор, Б.Регистратор.Дата,
	|	Б.Организация, Б.Подразделение,
	|	Б.Подразделение.А_НаправлениеДеятельности,
	|	Б.БанковскийСчет,
	|	Б.СтатьяДвиженияДенежныхСредств,
	|	Б.СтатьяДвиженияДенежныхСредств.А_РазделCFS,
	|	Б.БанковскийСчет.ВалютаДенежныхСредств
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|// Branch 2: ERP_Нал — РегНакоп.ДенежныеСредстваНаличные (raw table)
	|ВЫБРАТЬ
	|	Н.Регистратор.Дата,
	|	Н.Организация,
	|	Н.Подразделение,
	|	Н.Подразделение.А_НаправлениеДеятельности,
	|	Н.Касса,
	|	Н.СтатьяДвиженияДенежныхСредств,
	|	Н.СтатьяДвиженияДенежныхСредств.А_РазделCFS,
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка),
	|	Н.Регистратор,
	|	ВЫБОР КОГДА СУММА(Н.Сумма) >= 0
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыДвиженияДенежныхСредств.Поступление)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыДвиженияДенежныхСредств.Списание)
	|	КОНЕЦ,
	|	Н.Касса.ВалютаДенежныхСредств,
	|	1,
	|	ВЫБОР КОГДА СУММА(Н.Сумма) < 0 ТОГДА -СУММА(Н.Сумма) ИНАЧЕ СУММА(Н.Сумма) КОНЕЦ,
	|	ВЫБОР КОГДА СУММА(Н.Сумма) < 0 ТОГДА -СУММА(Н.Сумма) ИНАЧЕ СУММА(Н.Сумма) КОНЕЦ,
	|	ЗНАЧЕНИЕ(Перечисление.А_ИсточникDDS.ERP_Нал)
	|ИЗ РегистрНакопления.ДенежныеСредстваНаличные КАК Н
	|ГДЕ Н.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Н.Активность И Н.Сумма <> 0
	|СГРУППИРОВАТЬ ПО
	|	Н.Регистратор, Н.Регистратор.Дата,
	|	Н.Организация, Н.Подразделение,
	|	Н.Подразделение.А_НаправлениеДеятельности,
	|	Н.Касса,
	|	Н.СтатьяДвиженияДенежныхСредств,
	|	Н.СтатьяДвиженияДенежныхСредств.А_РазделCFS,
	|	Н.Касса.ВалютаДенежныхСредств
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|// Branch 3: Казна — РегНакоп.А_ДвиженияДенегИзКазны (raw table)
	|// НаправлениеДеятельностиКазна is a dimension — available directly.
	|// NO ВидДвижения field — Сумма is signed (positive=Поступление, negative=Списание).
	|// ДокументДвиженияКазны is a реквизит — available in raw table.
	|ВЫБРАТЬ
	|	К.Регистратор.Дата,
	|	К.Организация,
	|	К.Подразделение,
	|	К.НаправлениеДеятельностиКазна,
	|	К.БанковскийСчетКасса,
	|	К.СтатьяДвиженияДенежныхСредств,
	|	К.СтатьяДвиженияДенежныхСредств.А_РазделCFS,
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка),
	|	К.ДокументДвиженияКазны,
	|	ВЫБОР КОГДА СУММА(К.Сумма) >= 0
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыДвиженияДенежныхСредств.Поступление)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыДвиженияДенежныхСредств.Списание)
	|	КОНЕЦ,
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка),
	|	1,
	|	ВЫБОР КОГДА СУММА(К.Сумма) < 0 ТОГДА -СУММА(К.Сумма) ИНАЧЕ СУММА(К.Сумма) КОНЕЦ,
	|	ВЫБОР КОГДА СУММА(К.Сумма) < 0 ТОГДА -СУММА(К.Сумма) ИНАЧЕ СУММА(К.Сумма) КОНЕЦ,
	|	ЗНАЧЕНИЕ(Перечисление.А_ИсточникDDS.Казна)
	|ИЗ РегистрНакопления.А_ДвиженияДенегИзКазны КАК К
	|ГДЕ К.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И К.Активность И К.Сумма <> 0
	|СГРУППИРОВАТЬ ПО
	|	К.Регистратор, К.Регистратор.Дата,
	|	К.Организация, К.Подразделение,
	|	К.НаправлениеДеятельностиКазна,
	|	К.БанковскийСчетКасса,
	|	К.СтатьяДвиженияДенежныхСредств,
	|	К.СтатьяДвиженияДенежныхСредств.А_РазделCFS,
	|	К.ДокументДвиженияКазны
	|;
	|
	|// Финальний SELECT — дані для РегистрСведений.А_ОтчетDDS_Свод.
	|// Колонки відповідають виміривам + ресурсам регістра (Загрузить() мапи по іменах).
	|// GROUP BY + СУММА на ресурсах: один і той самий Документ_Источник може з'явитись
	|// у двох гілках UNION ALL (наприклад РКО одночасно в ERP_Нал і в Казна).
	|// Без GROUP BY — дублікат ключа регістра → помилка при Записати().
	|ВЫБРАТЬ
	|	МИНИМУМ(Д.Период) КАК Период,
	|	Д.Организация,
	|	Д.Подразделение,
	|	Д.НаправлениеДеятельности,
	|	Д.БанковскийСчетКасса,
	|	Д.СтатьяДДС,
	|	МИНИМУМ(Д.CFS_Section) КАК CFS_Section,
	|	Д.Контрагент,
	|	Д.Договор,
	|	Д.Документ_Источник,
	|	МИНИМУМ(Д.ВидДвижения) КАК ВидДвижения,
	|	МИНИМУМ(Д.ВалютаОригинала) КАК ВалютаОригинала,
	|	МИНИМУМ(Д.Курс) КАК Курс,
	|	СУММА(Д.СуммаГрн) КАК СуммаГрн,
	|	СУММА(Д.СуммаВалОригинала) КАК СуммаВалОригинала,
	|	МИНИМУМ(Д.Source) КАК Source
	|ИЗ втDDS КАК Д
	|СГРУППИРОВАТЬ ПО
	|	Д.Организация,
	|	Д.Подразделение,
	|	Д.НаправлениеДеятельности,
	|	Д.БанковскийСчетКасса,
	|	Д.СтатьяДДС,
	|	Д.Контрагент,
	|	Д.Договор,
	|	Д.Документ_Источник";
КонецФункции

#КонецОбласти

#КонецЕсли
